MarlinFirmware/Marlin/frameworks/CMSIS/LPC1768/lib/chanfs/LPC176x.h
/*-------------------------------------------------------------------*/
/* LPC176x Register Definitions and Cortex-M3 Supplement Definitions */
/*       This file is a non-copyrighted public domain software       */
/*-------------------------------------------------------------------*/

#ifndef __LPC176x
#define __LPC176x
#include <stdint.h>

#define	USE_SV_SERVICE	0	/* Enable supervisor service for user mode task */


/* System Controls */
#define	EXTINT		(*(volatile uint32_t*)0x400FC140)
#define	EXTMODE		(*(volatile uint32_t*)0x400FC148)
#define	EXTPOLAR	(*(volatile uint32_t*)0x400FC14C)
#define	RSID		(*(volatile uint32_t*)0x400FC180)
#define	SCS			(*(volatile uint32_t*)0x400FC1A0)

/* Clocking and Power Controls */
#define	CLKSRCSEL	(*(volatile uint32_t*)0x400FC10C)
#define	PLL0CON		(*(volatile uint32_t*)0x400FC080)
#define	PLL0CFG		(*(volatile uint32_t*)0x400FC084)
#define	PLL0STAT	(*(volatile uint32_t*)0x400FC088)
#define	PLL0FEED	(*(volatile uint32_t*)0x400FC08C)
#define	PLL1CON		(*(volatile uint32_t*)0x400FC0A0)
#define	PLL1CFG		(*(volatile uint32_t*)0x400FC0A4)
#define	PLL1STAT	(*(volatile uint32_t*)0x400FC0A8)
#define	PLL1FEED	(*(volatile uint32_t*)0x400FC0AC)
#define	CCLKCFG		(*(volatile uint32_t*)0x400FC104)
#define	USBCLKCFG	(*(volatile uint32_t*)0x400FC108)
#define	PCLKSEL		( (volatile uint32_t*)0x400FC1A8)
#define	PCLKSEL0	(*(volatile uint32_t*)0x400FC1A8)
#define	PCLKSEL1	(*(volatile uint32_t*)0x400FC1AC)
#define	PCON		(*(volatile uint32_t*)0x400FC0C0)
#define	PCONP		(*(volatile uint32_t*)0x400FC0C4)
#define	CLKOUTCFG	(*(volatile uint32_t*)0x400FC1C8)

/* Flash Accelerator */
#define	FLASHCFG	(*(volatile uint32_t*)0x400FC000)

/* Pin Configurations */
#define	PINSEL		( (volatile uint32_t*)0x4002C000)
#define	PINSEL0		(*(volatile uint32_t*)0x4002C000)
#define	PINSEL1		(*(volatile uint32_t*)0x4002C004)
#define	PINSEL2		(*(volatile uint32_t*)0x4002C008)
#define	PINSEL3		(*(volatile uint32_t*)0x4002C00C)
#define	PINSEL4		(*(volatile uint32_t*)0x4002C010)
#define	PINSEL7		(*(volatile uint32_t*)0x4002C01C)
#define	PINSEL8		(*(volatile uint32_t*)0x4002C020)
#define	PINSEL9		(*(volatile uint32_t*)0x4002C024)
#define	PINSEL10	(*(volatile uint32_t*)0x4002C028)
#define	PINMODE		( (volatile uint32_t*)0x4002C040)
#define	PINMODE0	(*(volatile uint32_t*)0x4002C040)
#define	PINMODE1	(*(volatile uint32_t*)0x4002C044)
#define	PINMODE2	(*(volatile uint32_t*)0x4002C048)
#define	PINMODE3	(*(volatile uint32_t*)0x4002C04C)
#define	PINMODE4	(*(volatile uint32_t*)0x4002C050)
#define	PINMODE5	(*(volatile uint32_t*)0x4002C054)
#define	PINMODE6	(*(volatile uint32_t*)0x4002C058)
#define	PINMODE7	(*(volatile uint32_t*)0x4002C05C)
#define	PINMODE9	(*(volatile uint32_t*)0x4002C064)
#define	PINMODE_OD	( (volatile uint32_t*)0x4002C068)
#define	PINMODE_OD0	(*(volatile uint32_t*)0x4002C068)
#define	PINMODE_OD1	(*(volatile uint32_t*)0x4002C06C)
#define	PINMODE_OD2	(*(volatile uint32_t*)0x4002C070)
#define	PINMODE_OD3	(*(volatile uint32_t*)0x4002C074)
#define	PINMODE_OD4	(*(volatile uint32_t*)0x4002C078)
#define	I2CPADCFG	(*(volatile uint32_t*)0x4002C07C)

/* GPIO */
#define	FIO0DIR		(*(volatile uint32_t*)0x2009C000)
#define	FIO0DIRL	(*(volatile uint16_t*)0x2009C000)
#define	FIO0DIRH	(*(volatile uint16_t*)0x2009C002)
#define	FIO0DIR0	(*(volatile uint8_t*)0x2009C000)
#define	FIO0DIR1	(*(volatile uint8_t*)0x2009C001)
#define	FIO0DIR2	(*(volatile uint8_t*)0x2009C002)
#define	FIO0DIR3	(*(volatile uint8_t*)0x2009C003)

#define	FIO1DIR		(*(volatile uint32_t*)0x2009C020)
#define	FIO1DIRL	(*(volatile uint16_t*)0x2009C020)
#define	FIO1DIRH	(*(volatile uint16_t*)0x2009C022)
#define	FIO1DIR0	(*(volatile uint8_t*)0x2009C020)
#define	FIO1DIR1	(*(volatile uint8_t*)0x2009C021)
#define	FIO1DIR2	(*(volatile uint8_t*)0x2009C022)
#define	FIO1DIR3	(*(volatile uint8_t*)0x2009C023)

#define	FIO2DIR		(*(volatile uint32_t*)0x2009C040)
#define	FIO2DIRL	(*(volatile uint16_t*)0x2009C040)
#define	FIO2DIRH	(*(volatile uint16_t*)0x2009C042)
#define	FIO2DIR0	(*(volatile uint8_t*)0x2009C040)
#define	FIO2DIR1	(*(volatile uint8_t*)0x2009C041)
#define	FIO2DIR2	(*(volatile uint8_t*)0x2009C042)
#define	FIO2DIR3	(*(volatile uint8_t*)0x2009C043)

#define	FIO3DIR		(*(volatile uint32_t*)0x2009C060)
#define	FIO3DIRL	(*(volatile uint16_t*)0x2009C060)
#define	FIO3DIRH	(*(volatile uint16_t*)0x2009C062)
#define	FIO3DIR0	(*(volatile uint8_t*)0x2009C060)
#define	FIO3DIR1	(*(volatile uint8_t*)0x2009C061)
#define	FIO3DIR2	(*(volatile uint8_t*)0x2009C062)
#define	FIO3DIR3	(*(volatile uint8_t*)0x2009C063)

#define	FIO4DIR		(*(volatile uint32_t*)0x2009C080)
#define	FIO4DIRL	(*(volatile uint16_t*)0x2009C080)
#define	FIO4DIRH	(*(volatile uint16_t*)0x2009C082)
#define	FIO4DIR0	(*(volatile uint8_t*)0x2009C080)
#define	FIO4DIR1	(*(volatile uint8_t*)0x2009C081)
#define	FIO4DIR2	(*(volatile uint8_t*)0x2009C082)
#define	FIO4DIR3	(*(volatile uint8_t*)0x2009C083)

#define	FIO0MASK	(*(volatile uint32_t*)0x2009C010)
#define	FIO0MASKL	(*(volatile uint16_t*)0x2009C010)
#define	FIO0MASKH	(*(volatile uint16_t*)0x2009C012)
#define	FIO0MASK0	(*(volatile uint8_t*)0x2009C010)
#define	FIO0MASK1	(*(volatile uint8_t*)0x2009C011)
#define	FIO0MASK2	(*(volatile uint8_t*)0x2009C012)
#define	FIO0MASK3	(*(volatile uint8_t*)0x2009C013)

#define	FIO1MASK	(*(volatile uint32_t*)0x2009C030)
#define	FIO1MASKL	(*(volatile uint16_t*)0x2009C030)
#define	FIO1MASKH	(*(volatile uint16_t*)0x2009C032)
#define	FIO1MASK0	(*(volatile uint8_t*)0x2009C030)
#define	FIO1MASK1	(*(volatile uint8_t*)0x2009C031)
#define	FIO1MASK2	(*(volatile uint8_t*)0x2009C032)
#define	FIO1MASK3	(*(volatile uint8_t*)0x2009C033)

#define	FIO2MASK	(*(volatile uint32_t*)0x2009C050)
#define	FIO2MASKL	(*(volatile uint16_t*)0x2009C050)
#define	FIO2MASKH	(*(volatile uint16_t*)0x2009C052)
#define	FIO2MASK0	(*(volatile uint8_t*)0x2009C050)
#define	FIO2MASK1	(*(volatile uint8_t*)0x2009C051)
#define	FIO2MASK2	(*(volatile uint8_t*)0x2009C052)
#define	FIO2MASK3	(*(volatile uint8_t*)0x2009C053)

#define	FIO3MASK	(*(volatile uint32_t*)0x2009C070)
#define	FIO3MASKL	(*(volatile uint16_t*)0x2009C070)
#define	FIO3MASKH	(*(volatile uint16_t*)0x2009C072)
#define	FIO3MASK0	(*(volatile uint8_t*)0x2009C070)
#define	FIO3MASK1	(*(volatile uint8_t*)0x2009C071)
#define	FIO3MASK2	(*(volatile uint8_t*)0x2009C072)
#define	FIO3MASK3	(*(volatile uint8_t*)0x2009C073)

#define	FIO4MASK	(*(volatile uint32_t*)0x2009C090)
#define	FIO4MASKL	(*(volatile uint16_t*)0x2009C090)
#define	FIO4MASKH	(*(volatile uint16_t*)0x2009C092)
#define	FIO4MASK0	(*(volatile uint8_t*)0x2009C090)
#define	FIO4MASK1	(*(volatile uint8_t*)0x2009C091)
#define	FIO4MASK2	(*(volatile uint8_t*)0x2009C092)
#define	FIO4MASK3	(*(volatile uint8_t*)0x2009C093)

#define	FIO0PIN		(*(volatile uint32_t*)0x2009C014)
#define	FIO0PINL	(*(volatile uint16_t*)0x2009C014)
#define	FIO0PINH	(*(volatile uint16_t*)0x2009C016)
#define	FIO0PIN0	(*(volatile uint8_t*)0x2009C014)
#define	FIO0PIN1	(*(volatile uint8_t*)0x2009C015)
#define	FIO0PIN2	(*(volatile uint8_t*)0x2009C016)
#define	FIO0PIN3	(*(volatile uint8_t*)0x2009C017)

