MarlinFirmware/Marlin/frameworks/CMSIS/LPC1768/lib/chanfs/LPC176x.h
/* USB Device */
#define	USBClkCtrl		(*(volatile uint32_t*)0x5000CFF4)
#define	USBClkSt		(*(volatile uint32_t*)0x5000CFF8)
#define	USBIntSt		(*(volatile uint32_t*)0x400FC1C0)
#define	USBDevIntSt		(*(volatile uint32_t*)0x5000C200)
#define	USBDevIntEn		(*(volatile uint32_t*)0x5000C204)
#define	USBDevIntClr	(*(volatile uint32_t*)0x5000C208)
#define	USBDevIntSet	(*(volatile uint32_t*)0x5000C20C)
#define	USBDevIntPri	(*(volatile uint32_t*)0x5000C22C)
#define	USBEpIntSt		(*(volatile uint32_t*)0x5000C230)
#define	USBEpIntEn		(*(volatile uint32_t*)0x5000C234)
#define	USBEpIntClr		(*(volatile uint32_t*)0x5000C238)
#define	USBEpIntSet		(*(volatile uint32_t*)0x5000C23C)
#define	USBEpIntPri		(*(volatile uint32_t*)0x5000C240)
#define	USBReEp			(*(volatile uint32_t*)0x5000C244)
#define	USBEpIn			(*(volatile uint32_t*)0x5000C248)
#define	USBMaxPSize		(*(volatile uint32_t*)0x5000C24C)
#define	USBRxData		(*(volatile uint32_t*)0x5000C218)
#define	USBRxPLen		(*(volatile uint32_t*)0x5000C220)
#define	USBTxData		(*(volatile uint32_t*)0x5000C21C)
#define	USBTxPLen		(*(volatile uint32_t*)0x5000C224)
#define	USBCtrl			(*(volatile uint32_t*)0x5000C228)
#define	USBCmdCode		(*(volatile uint32_t*)0x5000C210)
#define	USBCmdData		(*(volatile uint32_t*)0x5000C214)
#define	USBDMARSt		(*(volatile uint32_t*)0x5000C250)
#define	USBDMARClr		(*(volatile uint32_t*)0x5000C254)
#define	USBDMARSet		(*(volatile uint32_t*)0x5000C258)
#define	USBUDCAH		(*(volatile uint32_t*)0x5000C280)
#define	USBEpDMASt		(*(volatile uint32_t*)0x5000C284)
#define	USBEpDMAEn		(*(volatile uint32_t*)0x5000C288)
#define	USBEpDMADis		(*(volatile uint32_t*)0x5000C28C)
#define	USBDMAIntSt		(*(volatile uint32_t*)0x5000C290)
#define	USBDMAIntEn		(*(volatile uint32_t*)0x5000C294)
#define	USBEoTIntSt		(*(volatile uint32_t*)0x5000C2A0)
#define	USBEoTIntClr	(*(volatile uint32_t*)0x5000C2A4)
#define	USBEoTIntSet	(*(volatile uint32_t*)0x5000C2A8)
#define	USBNDDRIntSt	(*(volatile uint32_t*)0x5000C2AC)
#define	USBNDDRIntClr	(*(volatile uint32_t*)0x5000C2B0)
#define	USBNDDRIntSet	(*(volatile uint32_t*)0x5000C2B4)
#define	USBSysErrIntSt	(*(volatile uint32_t*)0x5000C2B8)
#define	USBSysErrIntClr	(*(volatile uint32_t*)0x5000C2BC)
#define	USBSysErrIntSet	(*(volatile uint32_t*)0x5000C2C0)

/* USB OTG */
#define	USBIntSt	(*(volatile uint32_t*)0x400FC1C0)
#define	OTGIntSt	(*(volatile uint32_t*)0x5000C100)
#define	OTGIntEn	(*(volatile uint32_t*)0x5000C104)
#define	OTGIntSet	(*(volatile uint32_t*)0x5000C108)
#define	OTGIntClr	(*(volatile uint32_t*)0x5000C10C)
#define	OTGStCtrl	(*(volatile uint32_t*)0x5000C110)
#define	OTGTmr		(*(volatile uint32_t*)0x5000C114)
#define	I2C_RX		(*(volatile uint32_t*)0x5000C300)
#define	I2C_TX		(*(volatile uint32_t*)0x5000C300)
#define	I2C_STS		(*(volatile uint32_t*)0x5000C304)
#define	I2C_CTL		(*(volatile uint32_t*)0x5000C308)
#define	I2C_CLKHI	(*(volatile uint32_t*)0x5000C30C)
#define	I2C_CLKLO	(*(volatile uint32_t*)0x5000C310)
#define	OTGClkCtrl	(*(volatile uint32_t*)0x5000CFF4)
#define	OTGClkSt	(*(volatile uint32_t*)0x5000CFF8)

/* UART0,UART1,UART2,UART3 */
#define	U0RBR		(*(volatile uint32_t*)0x4000C000)
#define	U0THR		(*(volatile uint32_t*)0x4000C000)
#define	U0DLL		(*(volatile uint32_t*)0x4000C000)
#define	U0DLM		(*(volatile uint32_t*)0x4000C004)
#define	U0IER		(*(volatile uint32_t*)0x4000C004)
#define	U0IIR		(*(volatile uint32_t*)0x4000C008)
#define	U0FCR		(*(volatile uint32_t*)0x4000C008)
#define	U0LCR		(*(volatile uint32_t*)0x4000C00C)
#define	U0LSR		(*(volatile uint32_t*)0x4000C014)
#define	U0SCR		(*(volatile uint32_t*)0x4000C01C)
#define	U0ACR		(*(volatile uint32_t*)0x4000C020)
#define	U0ICR		(*(volatile uint32_t*)0x4000C024)
#define	U0FDR		(*(volatile uint32_t*)0x4000C028)
#define	U0TER		(*(volatile uint32_t*)0x4000C030)

#define	U1RBR		(*(volatile uint32_t*)0x40010000)
#define	U1THR		(*(volatile uint32_t*)0x40010000)
#define	U1DLL		(*(volatile uint32_t*)0x40010000)
#define	U1DLM		(*(volatile uint32_t*)0x40010004)
#define	U1IER		(*(volatile uint32_t*)0x40010004)
#define	U1IIR		(*(volatile uint32_t*)0x40010008)
#define	U1FCR		(*(volatile uint32_t*)0x40010008)
#define	U1LCR		(*(volatile uint32_t*)0x4001000C)
#define	U1MCR		(*(volatile uint32_t*)0x40010010)
#define	U1LSR		(*(volatile uint32_t*)0x40010014)
#define	U1MSR		(*(volatile uint32_t*)0x40010018)
#define	U1SCR		(*(volatile uint32_t*)0x4001001C)
#define	U1ACR		(*(volatile uint32_t*)0x40010020)
#define	U1FDR		(*(volatile uint32_t*)0x40010028)
#define	U1TER		(*(volatile uint32_t*)0x40010030)
#define	U1RS485CTRL	(*(volatile uint32_t*)0x4001004C)
#define	U1ADRMATCH	(*(volatile uint32_t*)0x40010050)
#define	U1RS485DLY	(*(volatile uint32_t*)0x40010054)

#define	U2RBR		(*(volatile uint32_t*)0x40098000)
#define	U2THR		(*(volatile uint32_t*)0x40098000)
#define	U2DLL		(*(volatile uint32_t*)0x40098000)
#define	U2DLM		(*(volatile uint32_t*)0x40098004)
#define	U2IER		(*(volatile uint32_t*)0x40098004)
#define	U2IIR		(*(volatile uint32_t*)0x40098008)
#define	U2FCR		(*(volatile uint32_t*)0x40098008)
#define	U2LCR		(*(volatile uint32_t*)0x4009800C)
#define	U2LSR		(*(volatile uint32_t*)0x40098014)
#define	U2SCR		(*(volatile uint32_t*)0x4009801C)
#define	U2ACR		(*(volatile uint32_t*)0x40098020)
#define	U2ICR		(*(volatile uint32_t*)0x40098024)
#define	U2FDR		(*(volatile uint32_t*)0x40098028)
#define	U2TER		(*(volatile uint32_t*)0x40098030)

#define	U3RBR		(*(volatile uint32_t*)0x4009C000)
#define	U3THR		(*(volatile uint32_t*)0x4009C000)
#define	U3DLL		(*(volatile uint32_t*)0x4009C000)
#define	U3DLM		(*(volatile uint32_t*)0x4009C004)
#define	U3IER		(*(volatile uint32_t*)0x4009C004)
#define	U3IIR		(*(volatile uint32_t*)0x4009C008)
#define	U3FCR		(*(volatile uint32_t*)0x4009C008)
#define	U3LCR		(*(volatile uint32_t*)0x4009C00C)
#define	U3LSR		(*(volatile uint32_t*)0x4009C014)
#define	U3SCR		(*(volatile uint32_t*)0x4009C01C)
#define	U3ACR		(*(volatile uint32_t*)0x4009C020)
#define	U3ICR		(*(volatile uint32_t*)0x4009C024)
#define	U3FDR		(*(volatile uint32_t*)0x4009C028)
#define	U3TER		(*(volatile uint32_t*)0x4009C030)

