MarlinFirmware/Marlin/frameworks/CMSIS/LPC1768/lib/chanfs/LPC176x.h
/* Quadrature Encoder Interface */
#define	QEICON		(*(volatile uint32_t*)0x400BC000)
#define	QEICONF		(*(volatile uint32_t*)0x400BC008)
#define	QEISTAT		(*(volatile uint32_t*)0x400BC004)
#define	QEIPOS		(*(volatile uint32_t*)0x400BC00C)
#define	QEIMAXPOS	(*(volatile uint32_t*)0x400BC010)
#define	CMPOS0		(*(volatile uint32_t*)0x400BC014)
#define	CMPOS1		(*(volatile uint32_t*)0x400BC018)
#define	CMPOS2		(*(volatile uint32_t*)0x400BC01C)
#define	INXCNT		(*(volatile uint32_t*)0x400BC020)
#define	INXCMP		(*(volatile uint32_t*)0x400BC024)
#define	QEILOAD		(*(volatile uint32_t*)0x400BC028)
#define	QEITIME		(*(volatile uint32_t*)0x400BC02C)
#define	QEIVEL		(*(volatile uint32_t*)0x400BC030)
#define	QEICAP		(*(volatile uint32_t*)0x400BC034)
#define	VELCOMP		(*(volatile uint32_t*)0x400BC038)
#define	FILTER		(*(volatile uint32_t*)0x400BC03C)
#define	QEIINTSTAT	(*(volatile uint32_t*)0x400BCFE0)
#define	QEISET		(*(volatile uint32_t*)0x400BCFEC)
#define	QEICLR		(*(volatile uint32_t*)0x400BCFE8)
#define	QEIIE		(*(volatile uint32_t*)0x400BCFE4)
#define	QEIIES		(*(volatile uint32_t*)0x400BCFDC)
#define	QEIIEC		(*(volatile uint32_t*)0x400BCFD8)

/* RTC */
#define	RTC_ILR		(*(volatile uint32_t*)0x40024000)
#define	RTC_CCR		(*(volatile uint32_t*)0x40024008)
#define	RTC_CIIR	(*(volatile uint32_t*)0x4002400C)
#define	RTC_AMR		(*(volatile uint32_t*)0x40024010)
#define	RTC_AUX		(*(volatile uint32_t*)0x4002405C)
#define	RTC_AUXEN	(*(volatile uint32_t*)0x40024058)
#define	RTC_CTIME0	(*(volatile uint32_t*)0x40024014)
#define	RTC_CTIME1	(*(volatile uint32_t*)0x40024018)
#define	RTC_CTIME2	(*(volatile uint32_t*)0x4002401C)
#define	RTC_SEC		(*(volatile uint32_t*)0x40024020)
#define	RTC_MIN		(*(volatile uint32_t*)0x40024024)
#define	RTC_HOUR	(*(volatile uint32_t*)0x40024028)
#define	RTC_DOM		(*(volatile uint32_t*)0x4002402C)
#define	RTC_DOW		(*(volatile uint32_t*)0x40024030)
#define	RTC_DOY		(*(volatile uint32_t*)0x40024034)
#define	RTC_MONTH	(*(volatile uint32_t*)0x40024038)
#define	RTC_YEAR	(*(volatile uint32_t*)0x4002403C)
#define	RTC_CALIBRATION	(*(volatile uint32_t*)0x40024040)
#define	RTC_GPREG	( (volatile uint32_t*)0x40024044)
#define	RTC_GPREG0	(*(volatile uint32_t*)0x40024044)
#define	RTC_GPREG1	(*(volatile uint32_t*)0x40024048)
#define	RTC_GPREG2	(*(volatile uint32_t*)0x4002404C)
#define	RTC_GPREG3	(*(volatile uint32_t*)0x40024050)
#define	RTC_GPREG4	(*(volatile uint32_t*)0x40024054)
#define	RTC_ALSEC	(*(volatile uint32_t*)0x40024060)
#define	RTC_ALMIN	(*(volatile uint32_t*)0x40024064)
#define	RTC_ALHOUR	(*(volatile uint32_t*)0x40024068)
#define	RTC_ALDOM	(*(volatile uint32_t*)0x4002406C)
#define	RTC_ALDOW	(*(volatile uint32_t*)0x40024070)
#define	RTC_ALDOY	(*(volatile uint32_t*)0x40024074)
#define	RTC_ALMON	(*(volatile uint32_t*)0x40024078)
#define	RTC_ALYEAR	(*(volatile uint32_t*)0x4002407C)

/* WDT */
#define	WDMOD		(*(volatile uint32_t*)0x40000000)
#define	WDTC		(*(volatile uint32_t*)0x40000004)
#define	WDFEED		(*(volatile uint32_t*)0x40000008)
#define	WDTV		(*(volatile uint32_t*)0x4000000C)
#define	WDCLKSEL	(*(volatile uint32_t*)0x40000010)

/* ADC0 */
#define	AD0CR		(*(volatile uint32_t*)0x40034000)
#define	AD0GDR		(*(volatile uint32_t*)0x40034004)
#define	AD0INTEN	(*(volatile uint32_t*)0x4003400C)
#define	AD0DR		( (volatile uint32_t*)0x40034010)
#define	AD0DR0		(*(volatile uint32_t*)0x40034010)
#define	AD0DR1		(*(volatile uint32_t*)0x40034014)
#define	AD0DR2		(*(volatile uint32_t*)0x40034018)
#define	AD0DR3		(*(volatile uint32_t*)0x4003401C)
#define	AD0DR4		(*(volatile uint32_t*)0x40034020)
#define	AD0DR5		(*(volatile uint32_t*)0x40034024)
#define	AD0DR6		(*(volatile uint32_t*)0x40034028)
#define	AD0DR7		(*(volatile uint32_t*)0x4003402C)
#define	AD0STAT		(*(volatile uint32_t*)0x40034030)
#define	AD0TRM		(*(volatile uint32_t*)0x40034034)

/* DAC */
#define	DACR		(*(volatile uint32_t*)0x4008C000)
#define	DACCTRL		(*(volatile uint32_t*)0x4008C004)
#define	DACCNTVAL	(*(volatile uint32_t*)0x4008C008)

/* GPDMA */
#define	DMACIntStat		(*(volatile uint32_t*)0x50004000)
#define	DMACIntTCStat	(*(volatile uint32_t*)0x50004004)
#define	DMACIntTCClear	(*(volatile uint32_t*)0x50004008)
#define	DMACIntErrStat	(*(volatile uint32_t*)0x5000400C)
#define	DMACIntErrClr	(*(volatile uint32_t*)0x50004010)
#define	DMACRawIntTCStat	(*(volatile uint32_t*)0x50004014)
#define	DMACRawIntErrStat	(*(volatile uint32_t*)0x50004018)
#define	DMACEnbldChns	(*(volatile uint32_t*)0x5000401C)
#define	DMACSoftBReq	(*(volatile uint32_t*)0x50004020)
#define	DMACSoftSReq	(*(volatile uint32_t*)0x50004024)
#define	DMACSoftLBReq	(*(volatile uint32_t*)0x50004028)
#define	DMACSoftLSReq	(*(volatile uint32_t*)0x5000402C)
#define	DMACConfig		(*(volatile uint32_t*)0x50004030)
#define	DMACSync		(*(volatile uint32_t*)0x50004034)
#define	DMAREQSEL		(*(volatile uint32_t*)0x400FC1C4)
#define	DMACC0SrcAddr	(*(volatile uint32_t*)0x50004100)
#define	DMACC0DestAddr	(*(volatile uint32_t*)0x50004104)
#define	DMACC0LLI		(*(volatile uint32_t*)0x50004108)
#define	DMACC0Control	(*(volatile uint32_t*)0x5000410C)
#define	DMACC0Config	(*(volatile uint32_t*)0x50004110)
#define	DMACC1SrcAddr	(*(volatile uint32_t*)0x50004120)
#define	DMACC1DestAddr	(*(volatile uint32_t*)0x50004124)
#define	DMACC1LLI		(*(volatile uint32_t*)0x50004128)
#define	DMACC1Control	(*(volatile uint32_t*)0x5000412C)
#define	DMACC1Config	(*(volatile uint32_t*)0x50004130)
#define	DMACC2SrcAddr	(*(volatile uint32_t*)0x50004140)
#define	DMACC2DestAddr	(*(volatile uint32_t*)0x50004144)
#define	DMACC2LLI		(*(volatile uint32_t*)0x50004148)
#define	DMACC2Control	(*(volatile uint32_t*)0x5000414C)
#define	DMACC2Config	(*(volatile uint32_t*)0x50004150)
#define	DMACC3SrcAddr	(*(volatile uint32_t*)0x50004160)
#define	DMACC3DestAddr	(*(volatile uint32_t*)0x50004164)
#define	DMACC3LLI		(*(volatile uint32_t*)0x50004168)
#define	DMACC3Control	(*(volatile uint32_t*)0x5000416C)
#define	DMACC3Config	(*(volatile uint32_t*)0x50004170)
#define	DMACC4SrcAddr	(*(volatile uint32_t*)0x50004180)
#define	DMACC4DestAddr	(*(volatile uint32_t*)0x50004184)
#define	DMACC4LLI		(*(volatile uint32_t*)0x50004188)
#define	DMACC4Control	(*(volatile uint32_t*)0x5000418C)
#define	DMACC4Config	(*(volatile uint32_t*)0x50004190)
#define	DMACC5SrcAddr	(*(volatile uint32_t*)0x500041A0)
#define	DMACC5DestAddr	(*(volatile uint32_t*)0x500041A4)
#define	DMACC5LLI		(*(volatile uint32_t*)0x500041A8)
#define	DMACC5Control	(*(volatile uint32_t*)0x500041AC)
#define	DMACC5Config	(*(volatile uint32_t*)0x500041B0)
#define	DMACC6SrcAddr	(*(volatile uint32_t*)0x500041C0)
#define	DMACC6DestAddr	(*(volatile uint32_t*)0x500041C4)
#define	DMACC6LLI		(*(volatile uint32_t*)0x500041C8)
#define	DMACC6Control	(*(volatile uint32_t*)0x500041CC)
#define	DMACC6Config	(*(volatile uint32_t*)0x500041D0)
#define	DMACC7SrcAddr	(*(volatile uint32_t*)0x500041E0)
#define	DMACC7DestAddr	(*(volatile uint32_t*)0x500041E4)
#define	DMACC7LLI		(*(volatile uint32_t*)0x500041E8)
#define	DMACC7Control	(*(volatile uint32_t*)0x500041EC)
#define	DMACC7Config	(*(volatile uint32_t*)0x500041F0)


